; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_1 object type_3 type_2)
 (:predicates (pred_4 ?v4 - type_3 ?v3 - type_1)
 	      (pred_3 ?v8 - object ?v3 - type_1)
	      (pred_2 ?v4 - type_3 ?v5 - type_2)
	      (pred_1 ?v4 - type_3 ?v8 - object ?v5 - type_2))

   (:action op_1
       :parameters  (?v4 - type_3 ?v1 ?v2 - type_1)
       :precondition (and  (pred_4 ?v4 ?v1))
       :effect (and  (pred_4 ?v4 ?v2)
		     (not (pred_4 ?v4 ?v1))))

   (:action op_2
       :parameters (?v4 - type_3 ?v7 - object ?v6 - type_1 ?v5 - type_2)
       :precondition  (and  (pred_3 ?v7 ?v6) (pred_4 ?v4 ?v6) (pred_2 ?v4 ?v5))
       :effect (and (pred_1 ?v4 ?v7 ?v5)
		    (not (pred_3 ?v7 ?v6)) 
		    (not (pred_2 ?v4 ?v5))))

   (:action op_3
       :parameters (?v4 - type_3 ?v7 - object ?v6 - type_1 ?v5 - type_2)
       :precondition  (and  (pred_1 ?v4 ?v7 ?v5) (pred_4 ?v4 ?v6))
       :effect (and (pred_3 ?v7 ?v6)
		    (pred_2 ?v4 ?v5)
		    (not (pred_1 ?v4 ?v7 ?v5)))))

; problem
(define (problem gripper-2-3-3)
(:domain gripper-strips)
(:objects obj_12 obj_07 - type_3
obj_09 obj_03 obj_02 obj_10 - type_2
obj_04 obj_01 obj_06 - type_1
obj_11 obj_08 obj_05 - object)
(:init
(pred_4 obj_12 obj_04)
(pred_2 obj_12 obj_09)
(pred_2 obj_12 obj_03)
(pred_4 obj_07 obj_01)
(pred_2 obj_07 obj_02)
(pred_2 obj_07 obj_10)
(pred_3 obj_11 obj_01)
(pred_3 obj_08 obj_06)
(pred_3 obj_05 obj_04)
)
(:goal
(and
(pred_3 obj_11 obj_04)
(pred_3 obj_08 obj_04)
(pred_3 obj_05 obj_04)
)
)

(:constraints
  (and
    (always (not (and (pred_4 obj_12 obj_04) (pred_4 obj_07 obj_04))))
  )
)
)

; plan
1. (op_2 obj_07 obj_11 obj_01 obj_10)
   deleted: (pred_3 obj_11 obj_01) (pred_2 obj_07 obj_10)
   added: (pred_1 obj_07 obj_11 obj_10)
   goals met: 1 of 3
2. (op_1 obj_12 obj_04 obj_01)
   deleted: (pred_4 obj_12 obj_04)
   added: (pred_4 obj_12 obj_01)
   goals met: 1 of 3
3. (op_1 obj_07 obj_01 obj_06)
   deleted: (pred_4 obj_07 obj_01)
   added: (pred_4 obj_07 obj_06)
   goals met: 1 of 3
4. (op_2 obj_07 obj_08 obj_06 obj_02)
   deleted: (pred_3 obj_08 obj_06) (pred_2 obj_07 obj_02)
   added: (pred_1 obj_07 obj_08 obj_02)
   goals met: 1 of 3
5. (op_1 obj_07 obj_06 obj_04)
   deleted: (pred_4 obj_07 obj_06)
   added: (pred_4 obj_07 obj_04)
   goals met: 1 of 3
6. (op_3 obj_07 obj_08 obj_04 obj_02)
   deleted: (pred_1 obj_07 obj_08 obj_02)
   added: (pred_3 obj_08 obj_04) (pred_2 obj_07 obj_02)
   goals met: 2 of 3
7. (op_3 obj_07 obj_11 obj_04 obj_10)
   deleted: (pred_1 obj_07 obj_11 obj_10)
   added: (pred_3 obj_11 obj_04) (pred_2 obj_07 obj_10)
   goals met: 3 of 3
